Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Split up the IO from the parsing, handle errors separately in each case.
zh_cn: 从解析中分离出 IO，然后分别处理每种情况下的错误。

source: Squareness threshold of a stroke before it is recognized as a gesture.
zh_cn: 在笔划被识别为手势之前的方形阈值。

source: Staggered grids are likely to have gaps at the edges of the layout.
zh_cn: 交错网格很可能在布局边缘有间距。

source: Standard public methods of the type you would expect to see for a label component, for example setText(), setTextSize(), setTextColor() and so on.
zh_cn: 添加 Label 标签应该有的标准方法，比如 setText()、 setTextSize()、 setTextColor() 等等。

source: Start by dragging a view from the Palette window into the editor.
zh_cn: 把 view 从 Palette 窗口拖到编辑器中开始。

source: Start by working on onDraw(), which will give you the biggest payback.
zh_cn: 首先处理 onDraw()，这将为你带来最大的回报。

source: Start scrolling based on a fling gesture.
zh_cn: 基于 fling 手势开始滚动。

source: Start scrolling by providing a starting point and the distance to travel.
zh_cn: 通过提供起点和行程距离开始滚动。

source: Start scrolling by providing a starting point, the distance to travel, and the duration of the scroll.
zh_cn: 通过提供起点，行程距离和滚动持续时间开始滚动。

source: Starting with Android 3.0, the preferred way of animating views is to use the android.animation package APIs.
zh_cn: 从安卓 3.0 开始，对 view 进行动画较好的方式是使用 android.animation 包的相关 API。

source: Starts a smooth scroll to an adapter position.
zh_cn: 开始一个平滑的滚动到一个 adapter position。

source: State persisted across instances
zh_cn: 跨实例持久化的状态

source: Static field names start with s.
zh_cn: 静态字段的名称以 s 开头。

source: Static library support version of the framework's Fragment.
zh_cn: 该类是框架的 Fragment 的静态库支持版本。

source: Status bar scrim
zh_cn: 状态栏稀 scrim

source: Stop a nested scroll in progress.
zh_cn: 停止进行中的嵌套的滚动。

source: Stop any current scroll in progress, such as one started by smoothScrollBy(int, int), fling(int, int) or a touch-initiated fling.
zh_cn: 停止任何进行中的滚动，比如由 smoothScrollBy(int, int)，fling(int, int) 或触摸开始的滚动。

source: Stops the animation.
zh_cn: 停止动画。

source: Stroke width can be set using the strokeWidth attribute.
zh_cn: 可以使用 strokeWidth 属性设置 stroke 宽度。

source: Stroke width can be set using the app:strokeWidth attribute.
zh_cn: 可以使用 app:strokeWidth 属性设置 stroke 宽度。

source: Structural changes are when items are inserted, removed or moved within the data set.
zh_cn: 结构更改是指在数据集中插入、移除或移动项目。

source: Stub/no-op implementations of all methods of DrawerLayout.DrawerListener.
zh_cn: DrawerLayout.DrawerListener 的所有方法的存根/无操作实现。

source: Style (normal, bold, italic, bold|italic) for the text.
zh_cn: 文本的样式(正常，粗体，斜体，粗体|斜体)。

source: Styles are not applied
zh_cn: 样式未运用

source: Subclass a View
zh_cn: 实现 View 的子类

source: Subclasses of Object may override this definition.
zh_cn: Object 的子类可以覆盖此定义。

source: Subclasses only need to implement getItem(int) and getCount() to have a working adapter.
zh_cn: 子类只需要实现 getItem(int) 和 getCount() 就可以让 adapter 工作。

source: Subclasses should only override this if they are implementing something that should be seen as a completely new class of view when used by accessibility, unrelated to the class it is deriving from.
zh_cn: 子类只应重写它，如果它们实现的东西应该被可访问性使用时视为一个全新的 view 类，与它派生的类无关。

source: Subclasses should override onMeasure(int, int) to provide better measurements of their content.
zh_cn: 父类应该重写 onMeasure(int, int) 方法以提供其内容的更好的测量值。

source: Subclasses should override this method if the positions of items can change.
zh_cn: 如果项目的位置可以更改，子类应该覆盖此方法。

source: Subclasses that do not scroll should generally override this method and return false.
zh_cn: 不滚动的子类通常应重写此方法并返回 false。

source: Subtract the first path from the second path.
zh_cn: 差集，从第二条路径中减去第一条路径。

source: Subtract the second path from the first path.
zh_cn: 差集，从第一个路径中减去第二个路径。

source: Subtract the time already spent
zh_cn: 减去已经花费的时间

source: Such a condition should only be logged by a module that reasonably believes that it is the most authoritative in that domain (to avoid duplicate logging by non-authoritative components).
zh_cn: 这种情况应该仅由一个被视为该领域最具权威性的模块来记录(避免由非权威组件重复记录)。

source: Such a content stream can for instance be a video or an OpenGL scene.
zh_cn: 这样的内容流可以例如是视频或 OpenGL 场景。

source: Such a group is flexible only if all of the components within it are flexible.
zh_cn: 这样的组只有在其内部组件的 都 是灵活的情况下才是灵活的。

source: Such artifacts may occur on previous versions of the platform when its window is positioned asynchronously.
zh_cn: 当其窗口异步定位时，此类工件可能出现在平台的先前版本上。

source: Such common issues include:
zh_cn: 这些常见问题包括：

source: Summary
zh_cn: 摘要

source: Supply a scrim color that will be painted behind the associated child view.
zh_cn: 提供将在相关子 view 后面绘制的稀松布颜色。

source: Supply a tag for this view containing a String, to be retrieved later with View.getTag() or searched for with View.findViewWithTag().
zh_cn: 为此 view 提供包含 String 的标记，稍后将使用 View.getTag() 获取或使用 View.findViewWithTag() 搜索。

source: Supply an identifier name for this view, to later retrieve it with View.findViewById() or Activity.findViewById().
zh_cn: 为此 view 提供标识符名称，以便稍后使用 View.findViewById() 或 Activity.findViewById() 检索 view。

source: Supply an instance to decodeDrawable or decodeBitmap, which will call onHeaderDecoded (in the same thread) once the size is known.
zh_cn: 提供一个实例给 decodeDrawable 或 decodeBitmap，它将调用 onHeaderDecoded(在同一个线程中)一旦知道了大小。

source: Support alternate controllers, such as D-pad and trackball
zh_cn: 支持备用控制器，如 D-pad 和轨迹球

source: Support only specific densities
zh_cn: 仅支持特定的密度

source: Supported formats are: #RRGGBB #AARRGGBB or one of the following names: 'red', 'blue', 'green', 'black', 'white', 'gray', 'cyan', 'magenta', 'yellow', 'lightgray', 'darkgray', 'grey', 'lightgrey', 'darkgrey', 'aqua', 'fuchsia', 'lime', 'maroon', 'navy', 'olive', 'purple', 'silver', 'teal'.
zh_cn: 支持的格式为：#RRGGBB #AARRGGBB 或以下名称之一：'red', 'blue', 'green', 'black', 'white', 'gray', 'cyan', 'magenta', 'yellow', 'lightgray', 'darkgray', 'grey', 'lightgrey', 'darkgrey', 'aqua', 'fuchsia', 'lime', 'maroon', 'navy', 'olive', 'purple', 'silver', 'teal'.

source: Supports both on-demand and continuous rendering.
zh_cn: 支持按需和连续渲染。

source: Swaps the current adapter with the provided one.
zh_cn: 使用提供的适配器交换当前适配器。

source: System.out and System.err get redirected to /dev/null, so your print statements will have no visible effects.
zh_cn: System.out 和 System.err 会重定向到 /dev/null，因此你的 print 语句不会产生可见效果。

source: TODO: consider cancelling an animation when an item is removed scrollBy, to return it to the pool faster
zh_cn: TODO：考虑在滚动移除项目时取消动画，以便更快地将其返回到池中

source: TODOs should include the string TODO in all caps, followed by a colon:
zh_cn: TODO 备注应该以全部大写的字符串 TODO 开头，后跟一个冒号：

source: TabItem is a special 'view' which allows you to declare tab items for a TabLayout within a layout.
zh_cn: TabItem 是一个特殊的“view”，允许你在布局中声明 TabLayout 的选项卡项。

source: TabLayout provides a horizontal layout to display tabs.
zh_cn: TabLayout 提供水平布局以显示选项卡。

source: TableLayout containers do not display border lines for their rows, columns, or cells.
zh_cn: TableLayout 容器不显示其行，列或单元格的边框线。

source: TableRow always enforces those values to be respectively ViewGroup.LayoutParams.MATCH_PARENT and ViewGroup.LayoutParams.WRAP_CONTENT.
zh_cn: TableRow 始终将这些值分别强制为 ViewGroup.LayoutParams.MATCH_PARENT 和 ViewGroup.LayoutParams.WRAP_CONTENT。

source: Tags are essentially an extra piece of information that can be associated with a view.
zh_cn: Tags 本质上是可以和一个 view 关联的额外的信息。

source: Tags may also be specified with arbitrary objects from code using setTag(Object) or setTag(int, Object).
zh_cn: Tags 也可以在代码中用 setTag(Object) 或 setTag(int, Object) 设置为任意的对象。

source: Tags may also be specified with arbitrary objects from code using setTag(java.lang.Object) or setTag(int, java.lang.Object).
zh_cn: Tag 也可以在代码中用 setTag(java.lang.Object) 或 setTag(int, java.lang.Object) 设置为任意的对象。

source: Tags may be specified with character sequence values in layout XML as either a single tag using the android:tag attribute or multiple tags using the <tag> child element:
zh_cn: Tags 可以在 XML 文件中申明为一个字符串值，用一个单一的标签 android:tag，或者用 <tag> 子标签申明多个 tag。

source: Taking some time to carefully define your view's interface reduces future maintenance costs.
zh_cn: 花些时间仔细定义 view 接口可以降低未来的维护成本。

source: Tapping on the current value allows to type in a desired value.
zh_cn: 点击当前值允许输入所需的值。

source: Tapping on the input field allows to type in a desired value.
zh_cn: 点击输入字段允许输入所需的值。

source: Tapping on the lesser or greater value selects it by animating the number axis up or down to make the chosen value current.
zh_cn: 点击较小或较大的值可通过向上或向下设置数字轴的动画来选择它，以使所选值为当前值。

source: Tasks can be moved to the foreground and background; all of the activities inside of a particular task always remain in the same order.
zh_cn: 任务可以移动到前台和后台；特定任务中的所有 activity 始终保持相同的顺序。

source: Temp storage to use for decoding.
zh_cn: 用于解码的临时存储。

source: Temporarily detach a child view.
zh_cn: 暂时分离一个子 view。

source: Temporarily detach and scrap all currently attached child views.
zh_cn: 暂时分离并废弃所有当前附加的子 views。

source: Temporary logging used to diagnose an issue that is hard to reproduce should be kept at the DEBUG or VERBOSE level and should be enclosed by if blocks that allow for disabling it entirely at compile time.
zh_cn: 用于诊断难以重现的问题的临时日志记录应采用 DEBUG 或 VERBOSE 级别，并且应当包裹在 if 块中，以便在编译期间将其完全停用。

source: Text direction is coming from the system Locale.
zh_cn: 文本方向来自系统区域设置。

source: Text direction is forced to LTR.
zh_cn: 文本方向被强制为 LTR。

source: Text direction is forced to RTL.
zh_cn: 文本方向被强制为 RTL。

source: Text direction is inherited through ViewGroup
zh_cn: 文本方向通过 ViewGroup 继承

source: Text direction is using "any-RTL" algorithm.
zh_cn: 文本方向使用“any-RTL”算法。

source: Text direction is using "first strong algorithm".
zh_cn: 文本方向使用“第一强算法”。

source: Text to set as the content description for the collapse button.
zh_cn: 要设置为折叠按钮的内容说明的文本。

source: Text to set as the content description for the navigation button located at the start of the toolbar.
zh_cn: 要设置为位于工具栏开头的导航按钮的内容描述的文本。

source: Text to use when the switch is in the checked/"on" state.
zh_cn: 当开关处于选中/“开启”状态时使用的文本。

source: Text to use when the switch is in the unchecked/"off" state.
zh_cn: 当开关处于未选中/“关闭”状态时使用的文本。

source: TextAppearance style for text displayed on the switch thumb.
zh_cn: TextOppearance 样式，用于切换 thumb 上显示的文本。

source: TextureView can only be used in a hardware accelerated window.
zh_cn: TextureView 只能在硬件加速窗口中使用。

source: Thanks to this sliding behavior, SlidingPaneLayout may be suitable for creating layouts that can smoothly adapt across many different screen sizes, expanding out fully on larger screens and collapsing on smaller screens.
zh_cn: 由于这种滑动行为，SlidingPaneLayout 可能适合创建可以平滑地适应多种不同屏幕尺寸的布局，在较大的屏幕上完全展开并在较小的屏幕上折叠。

source: That click listener is called on a frequency determined by setZoomSpeed(long) whenever the user long-presses on the ZoomButton.
zh_cn: 只要用户长按 ZoomButton，就会在 setZoomSpeed(long) 确定的频率上调用该点击监听器。

source: That is, if you specify SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN then you will get a stable layout for changes of the SYSTEM_UI_FLAG_FULLSCREEN mode; if you specify SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN and SYSTEM_UI_FLAG_LAYOUT_HIDE_NAVIGATION, then you can transition to SYSTEM_UI_FLAG_FULLSCREEN and SYSTEM_UI_FLAG_HIDE_NAVIGATION with a stable layout.
zh_cn: 也就是说，如果你指定 SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN，那么你将获得更改 SYSTEM_UI_FLAG_FULLSCREEN 模式的稳定布局;如果指定 SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN 和 SYSTEM_UI_FLAG_LAYOUT_HIDE_NAVIGATION，则可以转换为 SYSTEM_UI_FLAG_FULLSCREEN 和 SYSTEM_UI_FLAG_HIDE_NAVIGATION 的稳定布局。

source: The ".Icon" styles adjust padding slightly to achieve a better visual balance.
zh_cn: “.Icon”样式略微调整 padding 以实现更好的视觉平衡。

source: The "inverse" styles provide an inverse color scheme for the spinner, which may be necessary if your application uses a light colored theme (a white background).
zh_cn: “反向”样式为微调器提供反色方案，如果你的应用程序使用浅色主题(白色背景)，则可能需要这种方案。

source: The "previous" and "next" buttons are hidden until setPrevNextListeners() has been called
zh_cn: 隐藏“previous”和“next”按钮，直到调用 setPrevNextListeners() 为止

source: The "previous" and "next" buttons are visible but disabled if setPrevNextListeners() was called with null listeners
zh_cn: 如果使用 null 监听器调用 setPrevNextListeners()，则“previous”和“next”按钮可见但禁用

source: The "rewind" and "fastforward" buttons are shown unless requested otherwise by using the MediaController(Context, boolean) constructor with the boolean set to false
zh_cn: 除非通过使用 MediaController(Context，boolean) 构造函数并且布尔值设置为 false，否则将显示“倒带”和“快进”按钮

source: The (possibly empty) subsequence captured by the group during the previous match, or null if the group failed to match part of the input
zh_cn: 在以前的匹配期间组所捕获的子序列(可能为空)；如果组未能匹配输入的部分，则返回 null。

source: The (possibly empty) subsequence matched by the previous match, in string form
zh_cn: 以前匹配所匹配的字符串形式的子序列(可能为空)

source: The lint tool, a static code analyzer included in Android Studio, detects resources in your res/ folder that your code doesn't reference.
zh_cn: lint 工具是 Android Studio 中包含的静态代码分析器，用于检测 res/ 文件夹中代码未引用的资源。

source: The Draw 9-patch tool offers an extremely handy way to create your NinePatch images, using a WYSIWYG graphics editor.
zh_cn: Draw 9-patch 工具提供了极其方便的方法来创建自己的 NinePatch 图，使用 WYSIWYG 图形编辑器。

source: The Paging library extends the diff-based approach to additionally support paged loading.
zh_cn: Paging library 扩展了基于 diff 的方法，以额外支持分页加载。

source: The Converting Images to WebP dialog opens.
zh_cn: 打开 Converting Images to WebP 对话框。

source: The -c and -a arguments are optional and let you specify <category> and <action> for the intent.
zh_cn: -c 和 -a 参数是可选的，你可以指定 <category> 和 <action> 用于 intent。

source: The CharSequence instances used as formatting patterns when calling either setFormat24Hour(java.lang.CharSequence) or setFormat12Hour(java.lang.CharSequence) can contain styling information.
zh_cn: 调用 setFormat24Hour(java.lang.CharSequence) 或 setFormat12Hour(java.lang.CharSequence) 时，用于格式化模式的 CharSequence 实例可以包含样式信息。

source: The ImageInfo contains information about the encoded image, like its width and height, and the Source can be used to match to a particular Source if a single OnHeaderDecodedListener is used with multiple Source objects.
zh_cn: ImageInfo 包含有关编码图像的信息，如宽度和高度，Source 可用于匹配特定的 Source 如果单个 OnHeaderDecodedListener 与多个 Source 一起使用。

source: The MeasureSpec class is used by views to tell their parents how they want to be measured and positioned.
zh_cn: view 使用 MeasureSpec 类来告诉他们的父项他们想要如何测量和定位。

source: The OnHeaderDecodedListener can also be implemented as a lambda:
zh_cn: OnHeaderDecodedListener 也可以实现为 lambda：

source: The Scroller class computes scroll positions for you, but it does not automatically apply those positions to your view.
zh_cn: Scroller 类为你计算滚动位置，但它不会自动将这些位置应用于你的view。

source: The Scroller class is the basis for handling flywheel-style fling gestures.
zh_cn: Scroller 类是处理飞轮式 fling 手势的基础。

source: The TextInputEditText class is provided to be used as the input text child of this layout.
zh_cn: 提供 TextInputEditText 类作为此布局的输入文本子级。

source: The TextView class also takes care of its own scrolling, so does not require a HorizontalScrollView, but using the two together is possible to achieve the effect of a text view within a larger container.
zh_cn: TextView 类也负责自己的滚动，因此不需要 Horizo​​ntalScrollView，但是将两者结合使用可以在更大的范围内实现文本 view 的效果容器。

source: The View.MeasureSpec class is used by views to tell their parents how they want to be measured and positioned.
zh_cn: view 使用 View.MeasureSpec 类来告诉它们的父 view，它们想要怎样被测量和定位。

source: The android.graphics framework divides drawing into two areas:
zh_cn: android.graphics 框架将绘制划分为两个区域：

source: The appendReplacement and appendTail methods can be used in tandem in order to collect the result into an existing string buffer, or the more convenient replaceAll method can be used to create a string in which every matching subsequence in the input sequence is replaced.
zh_cn: 可以先后使用 appendReplacement 和 appendTail 方法将结果收集到现有的字符串缓冲区，或者使用更加便捷的 replaceAll 方法创建一个可以在其中替换输入序列中每个匹配子序列的字符串。

source: The find method scans the input sequence looking for the next subsequence that matches the pattern.
zh_cn: find 方法扫描输入序列以查找与该模式匹配的下一个子序列。

source: The lookingAt method attempts to match the input sequence, starting at the beginning, against the pattern.
zh_cn: lookingAt 尝试将输入序列从头开始与该模式匹配。

source: The matches method attempts to match the entire input sequence against the pattern.
zh_cn: matches 方法尝试将整个输入序列与该模式匹配。

source: The text property controls the text displayed in the label for the switch, whereas the off and on text controls the text on the thumb.
zh_cn: text 属性控制开关标签中显示的文本，而 off 和 on 文本控制 thumb 上的文字。

source: The <paths> element must contain one or more of the following child elements:
zh_cn: <paths> 元素必须包含以下一个或多个子元素：

source: The CDATASection interface inherits from the CharacterData interface through the Text interface.
zh_cn: CDATASection 接口通过 Text 接口从 CharacterData 接口继承。

source: The CharacterData.data attribute holds the text that is contained by the CDATA section.
zh_cn: CharacterData.data 属性保存 CDATA 部分包含的文本。

source: The Displayed metric appears in the logcat output as before.
zh_cn: Displayed 指标与之前一样出现在 logcat 输出中。

source: The Displayed metric in the logcat output does not necessarily capture the amount of time until all resources are loaded and displayed: it leaves out resources that are not referenced in the layout file or that the app creates as part of object initialization.
zh_cn: logcat 输出中的 Displayed 指标不一定捕获加载和显示所有资源之前的时间量：它会遗漏布局文件中未引用的资源或应用程序创建的资源作为对象初始化。

source: The String class represents character strings.
zh_cn: 类代表字符串。

source: The ZoomControls class displays a simple set of controls used for zooming and provides callbacks to register for events.
zh_cn: ZoomControls 类显示一组用于缩放的简单控件，并提供回调以注册事件。

source: The aapt tool can optimize the image resources placed in res/drawable/ with lossless compression during the build process.
zh_cn: aapt 工具可以在构建过程中使用无损压缩优化放置在 res/drawable/ 中的图像资源。

source: The aapt tool does not shrink PNG files contained in the asset/ folder.
zh_cn: aapt 工具不会缩小 asset/ 文件夹中包含的 PNG 文件。

source: The aapt tool may inflate PNG files that have already been compressed.
zh_cn: aapt 工具可能会放大已经压缩的 PNG 文件。

source: The finalize method is never invoked more than once by a Java virtual machine for any given object.
zh_cn: 对于任何给定的对象，Java 虚拟机从不会多次调用 finalize 方法。

source: The finalize method of class Object performs no special action; it simply returns normally.
zh_cn: 类 Object 的 finalize 方法不执行特殊操作;它只是正常返回。

source: The null resource ID.
zh_cn: null 资源 ID。

source: The onDraw() and onMeasure() methods (plus most of the other on... methods) will likely have suitable behavior so you don't have to override them.
zh_cn: onDraw() 和 onMeasure() 方法（加上其他的 on... 方法) 已经有合适的行为了，不需要重写它们。

source: The onDraw() method delivers you a Canvas upon which you can implement anything you want: 2D graphics, other standard or custom components, styled text, or anything else you can think of.
zh_cn: onDraw() 方法给你提供一个 Canvas，在其中你可以实现任何你想要的东西。2D 图形，其他标准或自定义的组件，带风格的文字，以及任何你想要的别的东西。

source: The pngcrush tool is particularly effective: This tool iterates over PNG filters and zlib (Deflate) parameters, using each combination of filters and parameters to compress the image.
zh_cn: pngcrush 工具特别有效：此工具使用过滤器和参数的每个组合来迭代 PNG 过滤器和 zlib(Deflate)参数以压缩图像。

source: The sampleSize is the number of pixels in either dimension that correspond to a single pixel in the output.
zh_cn: sampleSize 是任一维度中与输出中的单个像素对应的像素数。

source: The total time measurement begins at the app process start, and could include another activity that was started first but did not display anything to the screen.
zh_cn: total 时间量始于应用程序进程开始，可能包括另一个先启动但未向屏幕显示任何内容的 activity。

source: The ViewGroup subclass is the base class for layouts, which are invisible containers that hold other Views (or other ViewGroups) and define their layout properties.
zh_cn: 子类 ViewGroup 是 layouts 的基类，它是不可见的容器，持有其他 view(或其他 ViewGroup)并确定他们的布局特性。

source: The finalize method may take any action, including making this object available again to other threads; the usual purpose of finalize, however, is to perform cleanup actions before the object is irrevocably discarded.
zh_cn: finalize 方法可以采取任何操作，包括使该对象再次可用于其他线程;然而，finalize 的通常目的是在对象被不可撤销地丢弃之前执行清理操作。

source: The total time measurement is only shown when there is a difference between the single activity and total startup times.
zh_cn: 仅当单个 activity 与总启动时间之间存在差异时，才会显示 total 时间量。

source: The MaterialButtons in this group will be shown on a single line.
zh_cn: 此组中的 MaterialButton 将显示在一行中。

source: The SurfaceTexture can then be used to render content.
zh_cn: 然后可以使用 SurfaceTexture 来呈现内容。

source: The <color> element's name will be used as the resource ID.
zh_cn: <color> 元素的 name 将用作资源 ID。

source: The PieChart example does this in a method called init, which is called from the constructor from Java, but we can initialise inline in Kotlin:
zh_cn: PieChart 示例在名为 init 的方法中执行此操作，该方法是从 Java 的构造函数中调用的，但我们可以在 Kotlin 中初始化内联：

source: The <bool> element's name will be used as the resource ID.
zh_cn: <bool> 元素的 name 将用作资源 ID。

source: The Canvas class defines methods for drawing text, lines, bitmaps, and many other graphics primitives.
zh_cn: Canvas 类定义了绘制文本，线条，位图和许多其他图形基元的方法。

source: The Android property animation framework, introduced in Android 3.0, makes smooth transitions easy.
zh_cn: Android 3.0 中引入的 property animation framework 使平滑过渡变得容易。

source: The Android SDK tools compile your application's resources into the application binary at build time.
zh_cn: Android SDK 工具在构建时将应用程序的资源编译为应用程序二进制文件。

source: The Android framework provides a set of base classes and XML tags to help you create a view that meets all of these requirements.
zh_cn: Android 框架提供了一组基类和 XML 标记，可帮助你创建满足所有这些要求的视图。

source: The Android resource compiler does a lot of work for you to make calling obtainStyledAttributes() easier.
zh_cn: Android 资源编译器为你做了很多工作，使你更容易调用 obtainStyledAttributes()。

source: The Android resource system keeps track of all non-code assets associated with an application.
zh_cn: Android 资源系统跟踪与应用程序关联的所有非代码资产。

source: The Basic Approach
zh_cn: 基本的方法

source: The Bottom App Bar is an extension of Toolbar that supports a shaped background that "cradles" an attached FloatingActionButton.
zh_cn: 底部应用栏是工具栏的扩展，支持形状背景“cradles”附加的 FloatingActionButton。

source: The Chip widget is a thin view wrapper around the ChipDrawable, which contains all of the layout and draw logic.
zh_cn: Chip 小部件是 ChipDrawable 的薄 view 包装器，它包含所有布局和绘制逻辑。

source: The Color class defines methods for creating and converting color ints.
zh_cn: Color 类定义了创建和转换颜色 int 的方法。

source: The CustomView sample in the API Demos provides an example of a customized View.
zh_cn: 在 API Demos 中的 CustomView 的示例提供一个自定义 View 的示例。

source: The Definition
zh_cn: 定义

source: The EditText is created with these parameters when it is inflated from an XML layout file, thus, our constructor needs to both take them and pass them to the superclass constructor as well.
zh_cn: 当 EditText 从 XML 布局文件加载时，它用这些参数来创建。因此，我们的构造方法需要获取参数并传递给父类。

source: The IME options to set on the query text field.
zh_cn: 要在查询文本域上设置的 IME 选项。

source: The Java programming language does not guarantee which thread will invoke the finalize method for any given object.
zh_cn: Java 编程语言不能保证哪个线程将调用任何给定对象的 finalize 方法。

source: The LabelView sample demonstrates a number of different aspects of custom components:
zh_cn: 该 LabelView 示例展示了几个自定义组件不同的方面：

source: The MediaController will create a default set of controls and put them in a window floating above your application.
zh_cn: MediaController 将创建一组默认控件，并将它们放在浮动应用程序上方的窗口中。

source: The Path class encapsulates compound (multiple contour) geometric paths consisting of straight line segments, quadratic curves, and cubic curves.
zh_cn: Path 类封装了由直线段，二次曲线和三次曲线组成的复合(多个轮廓)几何路径。
